STMicroelectronics/STM32CubeMP13/Drivers/BSP/STM32MP13xx_DISCO/stm32mp13xx_disco_sd.c
}

/**
  * @brief  Initializes the SD MSP.
  * @param  hsd  SD handle
  * @retval None
  */
static void SD_MspInit(SD_HandleTypeDef *hsd)
{
  GPIO_InitTypeDef GPIO_Init_Structure;

  UNUSED(hsd);

  /* Enable SDIO clock */
  __HAL_RCC_SDMMC1_CLK_ENABLE();

  // Reset SDMMC1 Hw IP
   __HAL_RCC_SDMMC1_FORCE_RESET();
   __HAL_RCC_SDMMC1_RELEASE_RESET();

   /* Enable GPIOs clock */
   __HAL_RCC_GPIOC_CLK_ENABLE();
   __HAL_RCC_GPIOD_CLK_ENABLE();

   /* Enable DMAs clock */
   __HAL_RCC_DMA2_CLK_ENABLE();
   __HAL_RCC_DMAMUX1_CLK_ENABLE();

   GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
   GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;

   /* D0 D1 D2 D3 CK on PC8 PC9 PC10 PC11 PC12 - AF12 NOPULL*/
   GPIO_Init_Structure.Pull      = GPIO_NOPULL;
   GPIO_Init_Structure.Alternate = GPIO_AF12_SDIO1;
   GPIO_Init_Structure.Pin       = GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_11 | GPIO_PIN_12;
   HAL_GPIO_Init(GPIOC, &GPIO_Init_Structure);

   /* CMD on PD2 - AF12 NOPULL*/
   GPIO_Init_Structure.Pull      = GPIO_NOPULL;
   GPIO_Init_Structure.Alternate = GPIO_AF12_SDIO1;
   GPIO_Init_Structure.Pin       = GPIO_PIN_2;
   HAL_GPIO_Init(GPIOD, &GPIO_Init_Structure);

  #if defined (CORE_CA7)
    IRQ_SetPriority(SDMMC1_IRQn, DEFAULT_IRQ_PRIO);
    IRQ_Enable(SDMMC1_IRQn);
  #endif
}

/**
  * @brief  DeInitializes the SD MSP.
  * @param  hsd  SD handle
  * @retval None
  */
static void SD_MspDeInit(SD_HandleTypeDef *hsd)
{
  GPIO_InitTypeDef gpio_init_structure;

  if(hsd == &hsd_sdmmc[0])
  {
    #if defined(CORE_CA7)
      IRQ_Disable(SDMMC1_IRQn);
    #endif

    /* GPIOC configuration */
    gpio_init_structure.Pin = GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_11 | GPIO_PIN_12;
    HAL_GPIO_DeInit(GPIOC, gpio_init_structure.Pin);

    /* GPIOD configuration */
    gpio_init_structure.Pin = GPIO_PIN_2;
    HAL_GPIO_DeInit(GPIOD, gpio_init_structure.Pin);
    /* Disable SDMMC1 clock */
    __HAL_RCC_SDMMC1_CLK_DISABLE();
  }
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */